Autodesk.Revit.DB.BuildingType
An enumerated type listing all of the built-in parameter groups supported by Autodesk
Revit.
Remarks: Parameter groups are used to sort parameters within the gbXML Setting item of the Project Information dialog.

Autodesk.Revit.DB.BuildingType.kWorkshop
Building Type is Workshop.

Autodesk.Revit.DB.BuildingType.kWarehouse
Building Type is Warehouse.

Autodesk.Revit.DB.BuildingType.kTransportation
Building Type is Transportation.

Autodesk.Revit.DB.BuildingType.kTownHall
Building Type is TownHall.

Autodesk.Revit.DB.BuildingType.kSportsArena
Building Type is SportsArena.

Autodesk.Revit.DB.BuildingType.kSchoolOrUniversity
Building Type is SchoolOrUniversity.

Autodesk.Revit.DB.BuildingType.kRetail
Building Type is Retail.

Autodesk.Revit.DB.BuildingType.kReligiousBuilding
Building Type is ReligiousBuilding.

Autodesk.Revit.DB.BuildingType.kPostOffice
Building Type is PostOffice.

Autodesk.Revit.DB.BuildingType.kPoliceStation
Building Type is PoliceStation.

Autodesk.Revit.DB.BuildingType.kPerformingArtsTheater
Building Type is PerformingArtsTheater.

Autodesk.Revit.DB.BuildingType.kPenitentiary
Building Type is Penitentiary.

Autodesk.Revit.DB.BuildingType.kParkingGarage
Building Type is ParkingGarage.

Autodesk.Revit.DB.BuildingType.kOffice
Building Type is Office.

Autodesk.Revit.DB.BuildingType.kMuseum
Building Type is Museum.

Autodesk.Revit.DB.BuildingType.kMultiFamily
Building Type is MultiFamily.

Autodesk.Revit.DB.BuildingType.kMotionPictureTheatre
Building Type is MotionPictureTheatre.

Autodesk.Revit.DB.BuildingType.kMotel
Building Type is Motel.

Autodesk.Revit.DB.BuildingType.kManufacturing
Building Type is Manufacturing.

Autodesk.Revit.DB.BuildingType.kLibrary
Building Type is Library.

Autodesk.Revit.DB.BuildingType.kHotel
Building Type is Hotel.

Autodesk.Revit.DB.BuildingType.kHospitalOrHealthcare
Building Type is HospitalOrHealthcare.

Autodesk.Revit.DB.BuildingType.kGymnasium
Building Type is Gymnasium.

Autodesk.Revit.DB.BuildingType.kFireStation
Building Type is FireStation.

Autodesk.Revit.DB.BuildingType.kExerciseCenter
Building Type is ExerciseCenter.

Autodesk.Revit.DB.BuildingType.kDormitory
Building Type is Dormitory.

Autodesk.Revit.DB.BuildingType.kDiningFamily
Building Type is DiningFamily.

Autodesk.Revit.DB.BuildingType.kDiningCafeteriaFastFood
Building Type is DiningCafeteriaFastFood.

Autodesk.Revit.DB.BuildingType.kDiningBarLoungeOrLeisure
Building Type is DiningBarLoungeOrLeisure.

Autodesk.Revit.DB.BuildingType.kCourthouse
Building Type is Courthouse.

Autodesk.Revit.DB.BuildingType.kConventionCenter
Building Type is ConventionCenter.

Autodesk.Revit.DB.BuildingType.kAutomotiveFacility
Building Type is AutomotiveFacility.

Autodesk.Revit.DB.BuildingType.kNoOfBuildingTypes
Building Type is NoOfBuildingTypes.